/*
 * Выполнил: Черненко Петр, 9361
 * Задание: Т4 Циклическая система управления
 * Дата выполнения: 26.11.2023
 * Версия: 0.1
 *
 * Скрипт для компиляции и запуска программы:
 * gcc TR4_Chernenko_9361.c -o t_4
 * ./t_4
 */
// ------------------------------------------- //
/*
 * Общее описание программы:
 * Для управления некоторым объектом необходимо
 * обеспечить периодическое выполнение трех
 * независимых управляющих процедур.  Периоды
 * вызова процедур должны составлять 500, 750
 * и 1000 миллисекунд  соответственно, и запуск
 * каждой из них следует осуществлять от
 * периодических программных таймеров,
 * используя сигналы в качестве схемы
 * уведомления. При каждом выполнении процедуры
 * должен отображаться момент ее текущего
 * вызова и время, прошедшее с момента
 * предыдущего вызова
 */
// ------------------------------------------- //


// TODO: add code here

// ----------------------------------------//
/*
TODO: add output example here
*/
